MikroElektronika/core_packages/PIC/XC8/def/PIC18F258/mcu.h
// Register: TXB1D7
#define TXB1D7 TXB1D7
extern volatile unsigned char           TXB1D7              __at(0xF3D);
#ifndef _LIB_BUILD
asm("TXB1D7 equ 0F3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D70                :1;
        unsigned TXB1D71                :1;
        unsigned TXB1D72                :1;
        unsigned TXB1D73                :1;
        unsigned TXB1D74                :1;
        unsigned TXB1D75                :1;
        unsigned TXB1D76                :1;
        unsigned TXB1D77                :1;
    };
} TXB1D7bits_t;
extern volatile TXB1D7bits_t TXB1D7bits __at(0xF3D);
// bitfield macros
#define _TXB1D7_TXB1D70_POSN                                0x0
#define _TXB1D7_TXB1D70_POSITION                            0x0
#define _TXB1D7_TXB1D70_SIZE                                0x1
#define _TXB1D7_TXB1D70_LENGTH                              0x1
#define _TXB1D7_TXB1D70_MASK                                0x1
#define _TXB1D7_TXB1D71_POSN                                0x1
#define _TXB1D7_TXB1D71_POSITION                            0x1
#define _TXB1D7_TXB1D71_SIZE                                0x1
#define _TXB1D7_TXB1D71_LENGTH                              0x1
#define _TXB1D7_TXB1D71_MASK                                0x2
#define _TXB1D7_TXB1D72_POSN                                0x2
#define _TXB1D7_TXB1D72_POSITION                            0x2
#define _TXB1D7_TXB1D72_SIZE                                0x1
#define _TXB1D7_TXB1D72_LENGTH                              0x1
#define _TXB1D7_TXB1D72_MASK                                0x4
#define _TXB1D7_TXB1D73_POSN                                0x3
#define _TXB1D7_TXB1D73_POSITION                            0x3
#define _TXB1D7_TXB1D73_SIZE                                0x1
#define _TXB1D7_TXB1D73_LENGTH                              0x1
#define _TXB1D7_TXB1D73_MASK                                0x8
#define _TXB1D7_TXB1D74_POSN                                0x4
#define _TXB1D7_TXB1D74_POSITION                            0x4
#define _TXB1D7_TXB1D74_SIZE                                0x1
#define _TXB1D7_TXB1D74_LENGTH                              0x1
#define _TXB1D7_TXB1D74_MASK                                0x10
#define _TXB1D7_TXB1D75_POSN                                0x5
#define _TXB1D7_TXB1D75_POSITION                            0x5
#define _TXB1D7_TXB1D75_SIZE                                0x1
#define _TXB1D7_TXB1D75_LENGTH                              0x1
#define _TXB1D7_TXB1D75_MASK                                0x20
#define _TXB1D7_TXB1D76_POSN                                0x6
#define _TXB1D7_TXB1D76_POSITION                            0x6
#define _TXB1D7_TXB1D76_SIZE                                0x1
#define _TXB1D7_TXB1D76_LENGTH                              0x1
#define _TXB1D7_TXB1D76_MASK                                0x40
#define _TXB1D7_TXB1D77_POSN                                0x7
#define _TXB1D7_TXB1D77_POSITION                            0x7
#define _TXB1D7_TXB1D77_SIZE                                0x1
#define _TXB1D7_TXB1D77_LENGTH                              0x1
#define _TXB1D7_TXB1D77_MASK                                0x80

// Register: CANSTATRO3
#define CANSTATRO3 CANSTATRO3
extern volatile unsigned char           CANSTATRO3          __at(0xF3E);
#ifndef _LIB_BUILD
asm("CANSTATRO3 equ 0F3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTATRO3bits_t;
extern volatile CANSTATRO3bits_t CANSTATRO3bits __at(0xF3E);
// bitfield macros
#define _CANSTATRO3_ICODE0_POSN                             0x1
#define _CANSTATRO3_ICODE0_POSITION                         0x1
#define _CANSTATRO3_ICODE0_SIZE                             0x1
#define _CANSTATRO3_ICODE0_LENGTH                           0x1
#define _CANSTATRO3_ICODE0_MASK                             0x2
#define _CANSTATRO3_ICODE1_POSN                             0x2
#define _CANSTATRO3_ICODE1_POSITION                         0x2
#define _CANSTATRO3_ICODE1_SIZE                             0x1
#define _CANSTATRO3_ICODE1_LENGTH                           0x1
#define _CANSTATRO3_ICODE1_MASK                             0x4
#define _CANSTATRO3_ICODE2_POSN                             0x3
#define _CANSTATRO3_ICODE2_POSITION                         0x3
#define _CANSTATRO3_ICODE2_SIZE                             0x1
#define _CANSTATRO3_ICODE2_LENGTH                           0x1
#define _CANSTATRO3_ICODE2_MASK                             0x8
#define _CANSTATRO3_OPMODE0_POSN                            0x5
#define _CANSTATRO3_OPMODE0_POSITION                        0x5
#define _CANSTATRO3_OPMODE0_SIZE                            0x1
#define _CANSTATRO3_OPMODE0_LENGTH                          0x1
#define _CANSTATRO3_OPMODE0_MASK                            0x20
#define _CANSTATRO3_OPMODE1_POSN                            0x6
#define _CANSTATRO3_OPMODE1_POSITION                        0x6
#define _CANSTATRO3_OPMODE1_SIZE                            0x1
#define _CANSTATRO3_OPMODE1_LENGTH                          0x1
#define _CANSTATRO3_OPMODE1_MASK                            0x40
#define _CANSTATRO3_OPMODE2_POSN                            0x7
#define _CANSTATRO3_OPMODE2_POSITION                        0x7
#define _CANSTATRO3_OPMODE2_SIZE                            0x1
#define _CANSTATRO3_OPMODE2_LENGTH                          0x1
#define _CANSTATRO3_OPMODE2_MASK                            0x80

// Register: TXB0CON
#define TXB0CON TXB0CON
extern volatile unsigned char           TXB0CON             __at(0xF40);
#ifndef _LIB_BUILD
asm("TXB0CON equ 0F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned                        :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
    };
    struct {
        unsigned TXB0PRI0               :1;
        unsigned TXB0PRI1               :1;
        unsigned                        :1;
        unsigned TXB0REQ                :1;
        unsigned TXB0ERR                :1;
        unsigned TXB0LARB               :1;
        unsigned TXB0ABT                :1;
    };
} TXB0CONbits_t;
extern volatile TXB0CONbits_t TXB0CONbits __at(0xF40);
// bitfield macros
#define _TXB0CON_TXPRI0_POSN                                0x0
#define _TXB0CON_TXPRI0_POSITION                            0x0
#define _TXB0CON_TXPRI0_SIZE                                0x1
#define _TXB0CON_TXPRI0_LENGTH                              0x1
#define _TXB0CON_TXPRI0_MASK                                0x1
#define _TXB0CON_TXPRI1_POSN                                0x1
#define _TXB0CON_TXPRI1_POSITION                            0x1
#define _TXB0CON_TXPRI1_SIZE                                0x1
#define _TXB0CON_TXPRI1_LENGTH                              0x1
#define _TXB0CON_TXPRI1_MASK                                0x2
#define _TXB0CON_TXREQ_POSN                                 0x3
#define _TXB0CON_TXREQ_POSITION                             0x3
#define _TXB0CON_TXREQ_SIZE                                 0x1
#define _TXB0CON_TXREQ_LENGTH                               0x1
#define _TXB0CON_TXREQ_MASK                                 0x8
#define _TXB0CON_TXERR_POSN                                 0x4
#define _TXB0CON_TXERR_POSITION                             0x4
#define _TXB0CON_TXERR_SIZE                                 0x1
#define _TXB0CON_TXERR_LENGTH                               0x1
#define _TXB0CON_TXERR_MASK                                 0x10
#define _TXB0CON_TXLARB_POSN                                0x5
#define _TXB0CON_TXLARB_POSITION                            0x5
#define _TXB0CON_TXLARB_SIZE                                0x1
#define _TXB0CON_TXLARB_LENGTH                              0x1
#define _TXB0CON_TXLARB_MASK                                0x20
#define _TXB0CON_TXABT_POSN                                 0x6
#define _TXB0CON_TXABT_POSITION                             0x6
#define _TXB0CON_TXABT_SIZE                                 0x1
#define _TXB0CON_TXABT_LENGTH                               0x1
#define _TXB0CON_TXABT_MASK                                 0x40
#define _TXB0CON_TXB0PRI0_POSN                              0x0
#define _TXB0CON_TXB0PRI0_POSITION                          0x0
#define _TXB0CON_TXB0PRI0_SIZE                              0x1
#define _TXB0CON_TXB0PRI0_LENGTH                            0x1
#define _TXB0CON_TXB0PRI0_MASK                              0x1
#define _TXB0CON_TXB0PRI1_POSN                              0x1
#define _TXB0CON_TXB0PRI1_POSITION                          0x1
#define _TXB0CON_TXB0PRI1_SIZE                              0x1
#define _TXB0CON_TXB0PRI1_LENGTH                            0x1
#define _TXB0CON_TXB0PRI1_MASK                              0x2
#define _TXB0CON_TXB0REQ_POSN                               0x3
#define _TXB0CON_TXB0REQ_POSITION                           0x3
#define _TXB0CON_TXB0REQ_SIZE                               0x1
#define _TXB0CON_TXB0REQ_LENGTH                             0x1
#define _TXB0CON_TXB0REQ_MASK                               0x8
#define _TXB0CON_TXB0ERR_POSN                               0x4
#define _TXB0CON_TXB0ERR_POSITION                           0x4
#define _TXB0CON_TXB0ERR_SIZE                               0x1
#define _TXB0CON_TXB0ERR_LENGTH                             0x1
#define _TXB0CON_TXB0ERR_MASK                               0x10
#define _TXB0CON_TXB0LARB_POSN                              0x5
#define _TXB0CON_TXB0LARB_POSITION                          0x5
#define _TXB0CON_TXB0LARB_SIZE                              0x1
#define _TXB0CON_TXB0LARB_LENGTH                            0x1
#define _TXB0CON_TXB0LARB_MASK                              0x20
#define _TXB0CON_TXB0ABT_POSN                               0x6
#define _TXB0CON_TXB0ABT_POSITION                           0x6
#define _TXB0CON_TXB0ABT_SIZE                               0x1
#define _TXB0CON_TXB0ABT_LENGTH                             0x1
#define _TXB0CON_TXB0ABT_MASK                               0x40

// Register: TXB0SIDH
#define TXB0SIDH TXB0SIDH
extern volatile unsigned char           TXB0SIDH            __at(0xF41);
#ifndef _LIB_BUILD
asm("TXB0SIDH equ 0F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned TXB0SID3               :1;
        unsigned TXB0SID4               :1;
        unsigned TXB0SID5               :1;
        unsigned TXB0SID6               :1;
        unsigned TXB0SID7               :1;
        unsigned TXB0SID8               :1;
        unsigned TXB0SID9               :1;
        unsigned TXB0SID10              :1;
    };
} TXB0SIDHbits_t;
extern volatile TXB0SIDHbits_t TXB0SIDHbits __at(0xF41);
// bitfield macros
#define _TXB0SIDH_SID3_POSN                                 0x0
#define _TXB0SIDH_SID3_POSITION                             0x0
#define _TXB0SIDH_SID3_SIZE                                 0x1
#define _TXB0SIDH_SID3_LENGTH                               0x1
#define _TXB0SIDH_SID3_MASK                                 0x1
#define _TXB0SIDH_SID4_POSN                                 0x1
#define _TXB0SIDH_SID4_POSITION                             0x1
#define _TXB0SIDH_SID4_SIZE                                 0x1
#define _TXB0SIDH_SID4_LENGTH                               0x1
#define _TXB0SIDH_SID4_MASK                                 0x2
#define _TXB0SIDH_SID5_POSN                                 0x2
#define _TXB0SIDH_SID5_POSITION                             0x2
#define _TXB0SIDH_SID5_SIZE                                 0x1
#define _TXB0SIDH_SID5_LENGTH                               0x1
#define _TXB0SIDH_SID5_MASK                                 0x4
#define _TXB0SIDH_SID6_POSN                                 0x3
#define _TXB0SIDH_SID6_POSITION                             0x3
#define _TXB0SIDH_SID6_SIZE                                 0x1
#define _TXB0SIDH_SID6_LENGTH                               0x1
#define _TXB0SIDH_SID6_MASK                                 0x8
#define _TXB0SIDH_SID7_POSN                                 0x4
#define _TXB0SIDH_SID7_POSITION                             0x4
#define _TXB0SIDH_SID7_SIZE                                 0x1
#define _TXB0SIDH_SID7_LENGTH                               0x1
#define _TXB0SIDH_SID7_MASK                                 0x10
#define _TXB0SIDH_SID8_POSN                                 0x5
#define _TXB0SIDH_SID8_POSITION                             0x5
#define _TXB0SIDH_SID8_SIZE                                 0x1
#define _TXB0SIDH_SID8_LENGTH                               0x1
#define _TXB0SIDH_SID8_MASK                                 0x20
#define _TXB0SIDH_SID9_POSN                                 0x6
#define _TXB0SIDH_SID9_POSITION                             0x6
#define _TXB0SIDH_SID9_SIZE                                 0x1
#define _TXB0SIDH_SID9_LENGTH                               0x1
#define _TXB0SIDH_SID9_MASK                                 0x40
#define _TXB0SIDH_SID10_POSN                                0x7
#define _TXB0SIDH_SID10_POSITION                            0x7
#define _TXB0SIDH_SID10_SIZE                                0x1
#define _TXB0SIDH_SID10_LENGTH                              0x1
#define _TXB0SIDH_SID10_MASK                                0x80
#define _TXB0SIDH_TXB0SID3_POSN                             0x0
#define _TXB0SIDH_TXB0SID3_POSITION                         0x0
#define _TXB0SIDH_TXB0SID3_SIZE                             0x1
#define _TXB0SIDH_TXB0SID3_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID3_MASK                             0x1
#define _TXB0SIDH_TXB0SID4_POSN                             0x1
#define _TXB0SIDH_TXB0SID4_POSITION                         0x1
#define _TXB0SIDH_TXB0SID4_SIZE                             0x1
#define _TXB0SIDH_TXB0SID4_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID4_MASK                             0x2
#define _TXB0SIDH_TXB0SID5_POSN                             0x2
#define _TXB0SIDH_TXB0SID5_POSITION                         0x2
#define _TXB0SIDH_TXB0SID5_SIZE                             0x1
#define _TXB0SIDH_TXB0SID5_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID5_MASK                             0x4
#define _TXB0SIDH_TXB0SID6_POSN                             0x3
#define _TXB0SIDH_TXB0SID6_POSITION                         0x3
#define _TXB0SIDH_TXB0SID6_SIZE                             0x1
#define _TXB0SIDH_TXB0SID6_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID6_MASK                             0x8
#define _TXB0SIDH_TXB0SID7_POSN                             0x4
#define _TXB0SIDH_TXB0SID7_POSITION                         0x4
#define _TXB0SIDH_TXB0SID7_SIZE                             0x1
#define _TXB0SIDH_TXB0SID7_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID7_MASK                             0x10
#define _TXB0SIDH_TXB0SID8_POSN                             0x5
#define _TXB0SIDH_TXB0SID8_POSITION                         0x5
#define _TXB0SIDH_TXB0SID8_SIZE                             0x1
#define _TXB0SIDH_TXB0SID8_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID8_MASK                             0x20
#define _TXB0SIDH_TXB0SID9_POSN                             0x6
#define _TXB0SIDH_TXB0SID9_POSITION                         0x6
#define _TXB0SIDH_TXB0SID9_SIZE                             0x1
#define _TXB0SIDH_TXB0SID9_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID9_MASK                             0x40
#define _TXB0SIDH_TXB0SID10_POSN                            0x7
#define _TXB0SIDH_TXB0SID10_POSITION                        0x7
#define _TXB0SIDH_TXB0SID10_SIZE                            0x1
#define _TXB0SIDH_TXB0SID10_LENGTH                          0x1
#define _TXB0SIDH_TXB0SID10_MASK                            0x80

