MikroElektronika/core_packages/PIC/XC8/def/PIC18F258/mcu.h
extern volatile RXB1D7bits_t RXB1D7bits __at(0xF5D);
// bitfield macros
#define _RXB1D7_RXB1D70_POSN                                0x0
#define _RXB1D7_RXB1D70_POSITION                            0x0
#define _RXB1D7_RXB1D70_SIZE                                0x1
#define _RXB1D7_RXB1D70_LENGTH                              0x1
#define _RXB1D7_RXB1D70_MASK                                0x1
#define _RXB1D7_RXB1D71_POSN                                0x1
#define _RXB1D7_RXB1D71_POSITION                            0x1
#define _RXB1D7_RXB1D71_SIZE                                0x1
#define _RXB1D7_RXB1D71_LENGTH                              0x1
#define _RXB1D7_RXB1D71_MASK                                0x2
#define _RXB1D7_RXB1D72_POSN                                0x2
#define _RXB1D7_RXB1D72_POSITION                            0x2
#define _RXB1D7_RXB1D72_SIZE                                0x1
#define _RXB1D7_RXB1D72_LENGTH                              0x1
#define _RXB1D7_RXB1D72_MASK                                0x4
#define _RXB1D7_RXB1D73_POSN                                0x3
#define _RXB1D7_RXB1D73_POSITION                            0x3
#define _RXB1D7_RXB1D73_SIZE                                0x1
#define _RXB1D7_RXB1D73_LENGTH                              0x1
#define _RXB1D7_RXB1D73_MASK                                0x8
#define _RXB1D7_RXB1D74_POSN                                0x4
#define _RXB1D7_RXB1D74_POSITION                            0x4
#define _RXB1D7_RXB1D74_SIZE                                0x1
#define _RXB1D7_RXB1D74_LENGTH                              0x1
#define _RXB1D7_RXB1D74_MASK                                0x10
#define _RXB1D7_RXB1D75_POSN                                0x5
#define _RXB1D7_RXB1D75_POSITION                            0x5
#define _RXB1D7_RXB1D75_SIZE                                0x1
#define _RXB1D7_RXB1D75_LENGTH                              0x1
#define _RXB1D7_RXB1D75_MASK                                0x20
#define _RXB1D7_RXB1D76_POSN                                0x6
#define _RXB1D7_RXB1D76_POSITION                            0x6
#define _RXB1D7_RXB1D76_SIZE                                0x1
#define _RXB1D7_RXB1D76_LENGTH                              0x1
#define _RXB1D7_RXB1D76_MASK                                0x40
#define _RXB1D7_RXB1D77_POSN                                0x7
#define _RXB1D7_RXB1D77_POSITION                            0x7
#define _RXB1D7_RXB1D77_SIZE                                0x1
#define _RXB1D7_RXB1D77_LENGTH                              0x1
#define _RXB1D7_RXB1D77_MASK                                0x80

// Register: CANSTATRO1
#define CANSTATRO1 CANSTATRO1
extern volatile unsigned char           CANSTATRO1          __at(0xF5E);
#ifndef _LIB_BUILD
asm("CANSTATRO1 equ 0F5Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTATRO1bits_t;
extern volatile CANSTATRO1bits_t CANSTATRO1bits __at(0xF5E);
// bitfield macros
#define _CANSTATRO1_ICODE0_POSN                             0x1
#define _CANSTATRO1_ICODE0_POSITION                         0x1
#define _CANSTATRO1_ICODE0_SIZE                             0x1
#define _CANSTATRO1_ICODE0_LENGTH                           0x1
#define _CANSTATRO1_ICODE0_MASK                             0x2
#define _CANSTATRO1_ICODE1_POSN                             0x2
#define _CANSTATRO1_ICODE1_POSITION                         0x2
#define _CANSTATRO1_ICODE1_SIZE                             0x1
#define _CANSTATRO1_ICODE1_LENGTH                           0x1
#define _CANSTATRO1_ICODE1_MASK                             0x4
#define _CANSTATRO1_ICODE2_POSN                             0x3
#define _CANSTATRO1_ICODE2_POSITION                         0x3
#define _CANSTATRO1_ICODE2_SIZE                             0x1
#define _CANSTATRO1_ICODE2_LENGTH                           0x1
#define _CANSTATRO1_ICODE2_MASK                             0x8
#define _CANSTATRO1_OPMODE0_POSN                            0x5
#define _CANSTATRO1_OPMODE0_POSITION                        0x5
#define _CANSTATRO1_OPMODE0_SIZE                            0x1
#define _CANSTATRO1_OPMODE0_LENGTH                          0x1
#define _CANSTATRO1_OPMODE0_MASK                            0x20
#define _CANSTATRO1_OPMODE1_POSN                            0x6
#define _CANSTATRO1_OPMODE1_POSITION                        0x6
#define _CANSTATRO1_OPMODE1_SIZE                            0x1
#define _CANSTATRO1_OPMODE1_LENGTH                          0x1
#define _CANSTATRO1_OPMODE1_MASK                            0x40
#define _CANSTATRO1_OPMODE2_POSN                            0x7
#define _CANSTATRO1_OPMODE2_POSITION                        0x7
#define _CANSTATRO1_OPMODE2_SIZE                            0x1
#define _CANSTATRO1_OPMODE2_LENGTH                          0x1
#define _CANSTATRO1_OPMODE2_MASK                            0x80

// Register: RXB0CON
#define RXB0CON RXB0CON
extern volatile unsigned char           RXB0CON             __at(0xF60);
#ifndef _LIB_BUILD
asm("RXB0CON equ 0F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0                :1;
        unsigned JTOFF                  :1;
        unsigned RXB0DBEN               :1;
        unsigned RXRTRRO                :1;
        unsigned                        :1;
        unsigned RXM0                   :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned RXB0FILHIT0            :1;
        unsigned RXB0FILHIT1            :1;
        unsigned RXB0FILHIT2            :1;
        unsigned RXB0FILHIT3            :1;
        unsigned                        :1;
        unsigned RXB0M0                 :1;
        unsigned RXB0M1                 :1;
        unsigned RXB0FUL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RXB0RTRR0              :1;
        unsigned                        :1;
        unsigned RXB0RTRRO              :1;
    };
} RXB0CONbits_t;
