MikroElektronika/core_packages/PIC/XC8/def/PIC18F258/mcu.h
extern volatile CANSTATbits_t CANSTATbits __at(0xF6E);
// bitfield macros
#define _CANSTAT_ICODE0_POSN                                0x1
#define _CANSTAT_ICODE0_POSITION                            0x1
#define _CANSTAT_ICODE0_SIZE                                0x1
#define _CANSTAT_ICODE0_LENGTH                              0x1
#define _CANSTAT_ICODE0_MASK                                0x2
#define _CANSTAT_ICODE1_POSN                                0x2
#define _CANSTAT_ICODE1_POSITION                            0x2
#define _CANSTAT_ICODE1_SIZE                                0x1
#define _CANSTAT_ICODE1_LENGTH                              0x1
#define _CANSTAT_ICODE1_MASK                                0x4
#define _CANSTAT_ICODE2_POSN                                0x3
#define _CANSTAT_ICODE2_POSITION                            0x3
#define _CANSTAT_ICODE2_SIZE                                0x1
#define _CANSTAT_ICODE2_LENGTH                              0x1
#define _CANSTAT_ICODE2_MASK                                0x8
#define _CANSTAT_OPMODE0_POSN                               0x5
#define _CANSTAT_OPMODE0_POSITION                           0x5
#define _CANSTAT_OPMODE0_SIZE                               0x1
#define _CANSTAT_OPMODE0_LENGTH                             0x1
#define _CANSTAT_OPMODE0_MASK                               0x20
#define _CANSTAT_OPMODE1_POSN                               0x6
#define _CANSTAT_OPMODE1_POSITION                           0x6
#define _CANSTAT_OPMODE1_SIZE                               0x1
#define _CANSTAT_OPMODE1_LENGTH                             0x1
#define _CANSTAT_OPMODE1_MASK                               0x40
#define _CANSTAT_OPMODE2_POSN                               0x7
#define _CANSTAT_OPMODE2_POSITION                           0x7
#define _CANSTAT_OPMODE2_SIZE                               0x1
#define _CANSTAT_OPMODE2_LENGTH                             0x1
#define _CANSTAT_OPMODE2_MASK                               0x80
#define _CANSTAT_EICODE1_POSN                               0x1
#define _CANSTAT_EICODE1_POSITION                           0x1
#define _CANSTAT_EICODE1_SIZE                               0x1
#define _CANSTAT_EICODE1_LENGTH                             0x1
#define _CANSTAT_EICODE1_MASK                               0x2
#define _CANSTAT_EICODE2_POSN                               0x2
#define _CANSTAT_EICODE2_POSITION                           0x2
#define _CANSTAT_EICODE2_SIZE                               0x1
#define _CANSTAT_EICODE2_LENGTH                             0x1
#define _CANSTAT_EICODE2_MASK                               0x4
#define _CANSTAT_EICODE3_POSN                               0x3
#define _CANSTAT_EICODE3_POSITION                           0x3
#define _CANSTAT_EICODE3_SIZE                               0x1
#define _CANSTAT_EICODE3_LENGTH                             0x1
#define _CANSTAT_EICODE3_MASK                               0x8

// Register: CANCON
#define CANCON CANCON
extern volatile unsigned char           CANCON              __at(0xF6F);
#ifndef _LIB_BUILD
asm("CANCON equ 0F6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCONbits_t;
extern volatile CANCONbits_t CANCONbits __at(0xF6F);
// bitfield macros
#define _CANCON_WIN0_POSN                                   0x1
#define _CANCON_WIN0_POSITION                               0x1
#define _CANCON_WIN0_SIZE                                   0x1
#define _CANCON_WIN0_LENGTH                                 0x1
#define _CANCON_WIN0_MASK                                   0x2
#define _CANCON_WIN1_POSN                                   0x2
#define _CANCON_WIN1_POSITION                               0x2
#define _CANCON_WIN1_SIZE                                   0x1
#define _CANCON_WIN1_LENGTH                                 0x1
#define _CANCON_WIN1_MASK                                   0x4
#define _CANCON_WIN2_POSN                                   0x3
#define _CANCON_WIN2_POSITION                               0x3
#define _CANCON_WIN2_SIZE                                   0x1
#define _CANCON_WIN2_LENGTH                                 0x1
#define _CANCON_WIN2_MASK                                   0x8
#define _CANCON_ABAT_POSN                                   0x4
#define _CANCON_ABAT_POSITION                               0x4
#define _CANCON_ABAT_SIZE                                   0x1
#define _CANCON_ABAT_LENGTH                                 0x1
#define _CANCON_ABAT_MASK                                   0x10
#define _CANCON_REQOP0_POSN                                 0x5
#define _CANCON_REQOP0_POSITION                             0x5
#define _CANCON_REQOP0_SIZE                                 0x1
#define _CANCON_REQOP0_LENGTH                               0x1
#define _CANCON_REQOP0_MASK                                 0x20
#define _CANCON_REQOP1_POSN                                 0x6
#define _CANCON_REQOP1_POSITION                             0x6
#define _CANCON_REQOP1_SIZE                                 0x1
#define _CANCON_REQOP1_LENGTH                               0x1
#define _CANCON_REQOP1_MASK                                 0x40
#define _CANCON_REQOP2_POSN                                 0x7
#define _CANCON_REQOP2_POSITION                             0x7
#define _CANCON_REQOP2_SIZE                                 0x1
#define _CANCON_REQOP2_LENGTH                               0x1
#define _CANCON_REQOP2_MASK                                 0x80
#define _CANCON_FP1_POSN                                    0x1
#define _CANCON_FP1_POSITION                                0x1
#define _CANCON_FP1_SIZE                                    0x1
#define _CANCON_FP1_LENGTH                                  0x1
#define _CANCON_FP1_MASK                                    0x2
#define _CANCON_FP2_POSN                                    0x2
#define _CANCON_FP2_POSITION                                0x2
#define _CANCON_FP2_SIZE                                    0x1
#define _CANCON_FP2_LENGTH                                  0x1
#define _CANCON_FP2_MASK                                    0x4
#define _CANCON_FP3_POSN                                    0x3
#define _CANCON_FP3_POSITION                                0x3
#define _CANCON_FP3_SIZE                                    0x1
#define _CANCON_FP3_LENGTH                                  0x1
#define _CANCON_FP3_MASK                                    0x8

